--
-- CREATE SEQUENCE
--
-- various error cases
CREATE UNLOGGED SEQUENCE sequence_testx;
ERROR:  unlogged sequences are not supported
CREATE SEQUENCE sequence_testx INCREMENT BY 0;
ERROR:  INCREMENT must not be zero
CREATE SEQUENCE sequence_testx INCREMENT BY -1 MINVALUE 20;
ERROR:  MINVALUE (20) must be less than MAXVALUE (-1)
CREATE SEQUENCE sequence_testx INCREMENT BY 1 MAXVALUE -20;
ERROR:  MINVALUE (1) must be less than MAXVALUE (-20)
CREATE SEQUENCE sequence_testx INCREMENT BY -1 START 10;
ERROR:  START value (10) cannot be greater than MAXVALUE (-1)
CREATE SEQUENCE sequence_testx INCREMENT BY 1 START -10;
ERROR:  START value (-10) cannot be less than MINVALUE (1)
CREATE SEQUENCE sequence_testx CACHE 0;
ERROR:  CACHE (0) must be greater than zero
-- OWNED BY errors
CREATE SEQUENCE sequence_testx OWNED BY nobody;  -- nonsense word
ERROR:  invalid OWNED BY option
HINT:  Specify OWNED BY table.column or OWNED BY NONE.
CREATE SEQUENCE sequence_testx OWNED BY pg_class_oid_index.oid;  -- not a table
ERROR:  referenced relation "pg_class_oid_index" is not a table or foreign table
CREATE SEQUENCE sequence_testx OWNED BY pg_class.relname;  -- not same schema
ERROR:  sequence must be in same schema as table it is linked to
CREATE TABLE sequence_test_table (a int primary key);
CREATE SEQUENCE sequence_testx OWNED BY sequence_test_table.b;  -- wrong column
ERROR:  column "b" of relation "sequence_test_table" does not exist
DROP TABLE sequence_test_table;
-- sequence data types
CREATE SEQUENCE sequence_test5 AS integer;
CREATE SEQUENCE sequence_test6 AS smallint;
CREATE SEQUENCE sequence_test7 AS bigint;
CREATE SEQUENCE sequence_test8 AS integer MAXVALUE 100000;
CREATE SEQUENCE sequence_test9 AS integer INCREMENT BY -1;
CREATE SEQUENCE sequence_test10 AS integer MINVALUE -100000 START 1;
CREATE SEQUENCE sequence_test11 AS smallint;
CREATE SEQUENCE sequence_test12 AS smallint INCREMENT -1;
CREATE SEQUENCE sequence_test13 AS smallint MINVALUE -32768;
CREATE SEQUENCE sequence_test14 AS smallint MAXVALUE 32767 INCREMENT -1;
CREATE SEQUENCE sequence_testx AS text;
ERROR:  sequence type must be smallint, integer, or bigint
CREATE SEQUENCE sequence_testx AS nosuchtype;
ERROR:  type "nosuchtype" does not exist
LINE 1: CREATE SEQUENCE sequence_testx AS nosuchtype;
                                          ^
CREATE SEQUENCE sequence_testx AS smallint MAXVALUE 100000;
ERROR:  MAXVALUE (100000) is out of range for sequence data type smallint
CREATE SEQUENCE sequence_testx AS smallint MINVALUE -100000;
ERROR:  MINVALUE (-100000) is out of range for sequence data type smallint
---
--- test creation of SERIAL column
---
CREATE TABLE serialTest1 (f1 text, f2 serial primary key);
INSERT INTO serialTest1 VALUES ('foo');
INSERT INTO serialTest1 VALUES ('bar');
INSERT INTO serialTest1 VALUES ('force', 100);
INSERT INTO serialTest1 VALUES ('wrong', NULL);
ERROR:  MySQL storage node (3, 7) returned error: 1048, Column 'f2' cannot be null.
SELECT * FROM serialTest1;
  f1   | f2  
-------+-----
 foo   |   1
 bar   |   2
 force | 100
(3 rows)

SELECT pg_get_serial_sequence('serialTest1', 'f2');
  pg_get_serial_sequence   
---------------------------
 public.serialtest1_f2_seq
(1 row)

-- test smallserial / bigserial
CREATE TABLE serialTest2 (f1 text, f2 serial, f3 smallserial, f4 serial2,
  f5 bigserial, f6 serial8 primary key);
INSERT INTO serialTest2 (f1)
  VALUES ('test_defaults');
INSERT INTO serialTest2 (f1, f2, f3, f4, f5, f6)
  VALUES ('test_max_vals', 2147483647, 32767, 32767, 9223372036854775807,
          9223372036854775807),
         ('test_min_vals', -2147483648, -32768, -32768, -9223372036854775808,
          -9223372036854775808);
-- All these INSERTs should fail:
INSERT INTO serialTest2 (f1, f3)
  VALUES ('bogus', -32769);
ERROR:  smallint out of range
INSERT INTO serialTest2 (f1, f4)
  VALUES ('bogus', -32769);
ERROR:  smallint out of range
INSERT INTO serialTest2 (f1, f3)
  VALUES ('bogus', 32768);
ERROR:  smallint out of range
INSERT INTO serialTest2 (f1, f4)
  VALUES ('bogus', 32768);
ERROR:  smallint out of range
INSERT INTO serialTest2 (f1, f5)
  VALUES ('bogus', -9223372036854775809);
ERROR:  bigint out of range
INSERT INTO serialTest2 (f1, f6)
  VALUES ('bogus', -9223372036854775809);
ERROR:  bigint out of range
INSERT INTO serialTest2 (f1, f5)
  VALUES ('bogus', 9223372036854775808);
ERROR:  bigint out of range
INSERT INTO serialTest2 (f1, f6)
  VALUES ('bogus', 9223372036854775808);
ERROR:  bigint out of range
SELECT * FROM serialTest2 ORDER BY f2 ASC;
      f1       |     f2      |   f3   |   f4   |          f5          |          f6          
---------------+-------------+--------+--------+----------------------+----------------------
 test_min_vals | -2147483648 | -32768 | -32768 | -9223372036854775808 | -9223372036854775808
 test_defaults |           1 |      1 |      1 |                    1 |                    1
 test_max_vals |  2147483647 |  32767 |  32767 |  9223372036854775807 |  9223372036854775807
(3 rows)

SELECT nextval('serialTest2_f2_seq');
 nextval 
---------
       2
(1 row)

SELECT nextval('serialTest2_f3_seq');
 nextval 
---------
       2
(1 row)

SELECT nextval('serialTest2_f4_seq');
 nextval 
---------
       2
(1 row)

SELECT nextval('serialTest2_f5_seq');
 nextval 
---------
       2
(1 row)

SELECT nextval('serialTest2_f6_seq');
 nextval 
---------
       2
(1 row)

-- basic sequence operations using both text and oid references
CREATE SEQUENCE sequence_test;
CREATE SEQUENCE IF NOT EXISTS sequence_test;
NOTICE:  relation "sequence_test" already exists, skipping
SELECT nextval('sequence_test'::text);
 nextval 
---------
       1
(1 row)

SELECT nextval('sequence_test'::regclass);
 nextval 
---------
       2
(1 row)

SELECT currval('sequence_test'::text);
 currval 
---------
       2
(1 row)

SELECT currval('sequence_test'::regclass);
 currval 
---------
       2
(1 row)

SELECT setval('sequence_test'::text, 32);
 setval 
--------
     32
(1 row)

SELECT nextval('sequence_test'::regclass);
 nextval 
---------
      33
(1 row)

SELECT setval('sequence_test'::text, 99, false);
 setval 
--------
     99
(1 row)

SELECT nextval('sequence_test'::regclass);
 nextval 
---------
     100
(1 row)

SELECT setval('sequence_test'::regclass, 32);
 setval 
--------
     32
(1 row)

SELECT nextval('sequence_test'::text);
 nextval 
---------
      33
(1 row)

SELECT setval('sequence_test'::regclass, 99, false);
 setval 
--------
     99
(1 row)

SELECT nextval('sequence_test'::text);
 nextval 
---------
     100
(1 row)

DISCARD SEQUENCES;
SELECT currval('sequence_test'::regclass);
ERROR:  currval of sequence "sequence_test" is not yet defined in this session
DROP SEQUENCE sequence_test;
-- renaming sequences
CREATE SEQUENCE foo_seq_new;
SELECT nextval('foo_seq_new');
 nextval 
---------
       1
(1 row)

DROP SEQUENCE foo_seq_new;
--
-- Check dependencies of serial and ordinary sequences
--
CREATE TEMP SEQUENCE myseq2;
CREATE TEMP SEQUENCE myseq3;
CREATE TEMP TABLE t1 (
  f1 serial,
  f2 int DEFAULT nextval('myseq2'),
  f3 int DEFAULT nextval('myseq3'::text)
);
-- Both drops should fail, but with different error messages:
DROP SEQUENCE t1_f1_seq;
ERROR:  cannot drop sequence t1_f1_seq because other objects depend on it
DETAIL:  default value for column f1 of table t1 depends on sequence t1_f1_seq
HINT:  Use DROP ... CASCADE to drop the dependent objects too.
DROP SEQUENCE myseq2;
ERROR:  cannot drop sequence myseq2 because other objects depend on it
DETAIL:  default value for column f2 of table t1 depends on sequence myseq2
HINT:  Use DROP ... CASCADE to drop the dependent objects too.
-- This however will work:
DROP SEQUENCE myseq3;
DROP TABLE t1;
-- Fails because no longer existent:
DROP SEQUENCE t1_f1_seq;
ERROR:  sequence "t1_f1_seq" does not exist
-- Now OK:
DROP SEQUENCE myseq2;
CREATE SEQUENCE sequence_test3;  -- not read from, to test is_called
-- Information schema
SELECT * FROM information_schema.sequences
  WHERE sequence_name ~ ANY(ARRAY['sequence_test', 'serialtest'])
  ORDER BY sequence_name ASC;
 sequence_catalog | sequence_schema |   sequence_name    | data_type | numeric_precision | numeric_precision_radix | numeric_scale | start_value | minimum_value |    maximum_value    | increment | cycle_option 
------------------+-----------------+--------------------+-----------+-------------------+-------------------------+---------------+-------------+---------------+---------------------+-----------+--------------
 regression       | public          | sequence_test10    | integer   |                32 |                       2 |             0 | 1           | -100000       | 2147483647          | 1         | NO
 regression       | public          | sequence_test11    | smallint  |                16 |                       2 |             0 | 1           | 1             | 32767               | 1         | NO
 regression       | public          | sequence_test12    | smallint  |                16 |                       2 |             0 | -1          | -32768        | -1                  | -1        | NO
 regression       | public          | sequence_test13    | smallint  |                16 |                       2 |             0 | -32768      | -32768        | 32767               | 1         | NO
 regression       | public          | sequence_test14    | smallint  |                16 |                       2 |             0 | 32767       | -32768        | 32767               | -1        | NO
 regression       | public          | sequence_test3     | bigint    |                64 |                       2 |             0 | 1           | 1             | 9223372036854775807 | 1         | NO
 regression       | public          | sequence_test5     | integer   |                32 |                       2 |             0 | 1           | 1             | 2147483647          | 1         | NO
 regression       | public          | sequence_test6     | smallint  |                16 |                       2 |             0 | 1           | 1             | 32767               | 1         | NO
 regression       | public          | sequence_test7     | bigint    |                64 |                       2 |             0 | 1           | 1             | 9223372036854775807 | 1         | NO
 regression       | public          | sequence_test8     | integer   |                32 |                       2 |             0 | 1           | 1             | 100000              | 1         | NO
 regression       | public          | sequence_test9     | integer   |                32 |                       2 |             0 | -1          | -2147483648   | -1                  | -1        | NO
 regression       | public          | serialtest1_f2_seq | integer   |                32 |                       2 |             0 | 1           | 1             | 2147483647          | 1         | NO
 regression       | public          | serialtest2_f2_seq | integer   |                32 |                       2 |             0 | 1           | 1             | 2147483647          | 1         | NO
 regression       | public          | serialtest2_f3_seq | smallint  |                16 |                       2 |             0 | 1           | 1             | 32767               | 1         | NO
 regression       | public          | serialtest2_f4_seq | smallint  |                16 |                       2 |             0 | 1           | 1             | 32767               | 1         | NO
 regression       | public          | serialtest2_f5_seq | bigint    |                64 |                       2 |             0 | 1           | 1             | 9223372036854775807 | 1         | NO
 regression       | public          | serialtest2_f6_seq | bigint    |                64 |                       2 |             0 | 1           | 1             | 9223372036854775807 | 1         | NO
(17 rows)

SELECT schemaname, sequencename, start_value, min_value, max_value, increment_by, cycle, cache_size, last_value
FROM pg_sequences
WHERE sequencename ~ ANY(ARRAY['sequence_test', 'serialtest'])
  ORDER BY sequencename ASC;
 schemaname |    sequencename    | start_value |  min_value  |      max_value      | increment_by | cycle | cache_size |   last_value    
------------+--------------------+-------------+-------------+---------------------+--------------+-------+------------+-----------------
 public     | sequence_test10    |           1 |     -100000 |          2147483647 |            1 | f     |          1 | 140712578777360
 public     | sequence_test11    |           1 |           1 |               32767 |            1 | f     |          1 | 140712578777360
 public     | sequence_test12    |          -1 |      -32768 |                  -1 |           -1 | f     |          1 | 140712578777360
 public     | sequence_test13    |      -32768 |      -32768 |               32767 |            1 | f     |          1 | 140712578777360
 public     | sequence_test14    |       32767 |      -32768 |               32767 |           -1 | f     |          1 | 140712578777360
 public     | sequence_test3     |           1 |           1 | 9223372036854775807 |            1 | f     |          1 | 140712578777360
 public     | sequence_test5     |           1 |           1 |          2147483647 |            1 | f     |          1 | 140712578777360
 public     | sequence_test6     |           1 |           1 |               32767 |            1 | f     |          1 | 140712578777360
 public     | sequence_test7     |           1 |           1 | 9223372036854775807 |            1 | f     |          1 | 140712578777360
 public     | sequence_test8     |           1 |           1 |              100000 |            1 | f     |          1 | 140712578777360
 public     | sequence_test9     |          -1 | -2147483648 |                  -1 |           -1 | f     |          1 | 140712578777360
 public     | serialtest1_f2_seq |           1 |           1 |          2147483647 |            1 | f     |          1 |              10
 public     | serialtest2_f2_seq |           1 |           1 |          2147483647 |            1 | f     |          1 |              10
 public     | serialtest2_f3_seq |           1 |           1 |               32767 |            1 | f     |          1 |              10
 public     | serialtest2_f4_seq |           1 |           1 |               32767 |            1 | f     |          1 |              10
 public     | serialtest2_f5_seq |           1 |           1 | 9223372036854775807 |            1 | f     |          1 |              10
 public     | serialtest2_f6_seq |           1 |           1 | 9223372036854775807 |            1 | f     |          1 |              10
(17 rows)

SELECT * FROM pg_sequence_parameters('sequence_test4'::regclass);
ERROR:  relation "sequence_test4" does not exist
LINE 1: SELECT * FROM pg_sequence_parameters('sequence_test4'::regcl...
                                             ^
\d sequence_test4
\d serialtest2_f2_seq
                 Sequence "public.serialtest2_f2_seq"
  Type   | Start | Minimum |  Maximum   | Increment | Cycles? | Cache 
---------+-------+---------+------------+-----------+---------+-------
 integer |     1 |       1 | 2147483647 |         1 | no      |     1
Owned by: public.serialtest2.f2

-- Test comments
COMMENT ON SEQUENCE asdf IS 'won''t work';
ERROR:  relation "asdf" does not exist
COMMENT ON SEQUENCE sequence_test2 IS 'will work';
ERROR:  relation "sequence_test2" does not exist
COMMENT ON SEQUENCE sequence_test2 IS NULL;
ERROR:  relation "sequence_test2" does not exist
-- Test lastval()
CREATE SEQUENCE seq;
SELECT nextval('seq');
 nextval 
---------
       1
(1 row)

SELECT lastval();
 lastval 
---------
       1
(1 row)

SELECT setval('seq', 99);
 setval 
--------
     99
(1 row)

SELECT lastval();
 lastval 
---------
      99
(1 row)

DISCARD SEQUENCES;
SELECT lastval();
ERROR:  lastval is not yet defined in this session
CREATE SEQUENCE seq2;
SELECT nextval('seq2');
 nextval 
---------
       1
(1 row)

SELECT lastval();
 lastval 
---------
       1
(1 row)

DROP SEQUENCE seq2;
-- should fail
SELECT lastval();
ERROR:  lastval is not yet defined in this session
CREATE USER regress_seq_user;
-- Test sequences in read-only transactions
CREATE TEMPORARY SEQUENCE sequence_test_temp1;
START TRANSACTION READ ONLY;
SELECT nextval('sequence_test_temp1');  -- ok
 nextval 
---------
       1
(1 row)

SELECT nextval('sequence_test2');  -- error
ERROR:  relation "sequence_test2" does not exist
LINE 1: SELECT nextval('sequence_test2');
                       ^
ROLLBACK;
START TRANSACTION READ ONLY;
SELECT setval('sequence_test_temp1', 1);  -- ok
 setval 
--------
      1
(1 row)

SELECT setval('sequence_test2', 1);  -- error
ERROR:  relation "sequence_test2" does not exist
LINE 1: SELECT setval('sequence_test2', 1);
                      ^
ROLLBACK;
-- privileges tests
-- nextval
CREATE SEQUENCE seq3;
BEGIN;
SET LOCAL SESSION AUTHORIZATION regress_seq_user;
REVOKE ALL ON seq3 FROM regress_seq_user;
ERROR:  permission denied for sequence seq3
GRANT SELECT ON seq3 TO regress_seq_user;
ERROR:  current transaction is aborted, commands ignored until end of transaction block
SELECT nextval('seq3');
ERROR:  current transaction is aborted, commands ignored until end of transaction block
ROLLBACK;
DROP SEQUENCE seq3;
CREATE SEQUENCE seq3;
BEGIN;
SET LOCAL SESSION AUTHORIZATION regress_seq_user;
REVOKE ALL ON seq3 FROM regress_seq_user;
ERROR:  permission denied for sequence seq3
GRANT UPDATE ON seq3 TO regress_seq_user;
ERROR:  current transaction is aborted, commands ignored until end of transaction block
SELECT nextval('seq3');
ERROR:  current transaction is aborted, commands ignored until end of transaction block
ROLLBACK;
DROP SEQUENCE seq3;
CREATE SEQUENCE seq3;
BEGIN;
SET LOCAL SESSION AUTHORIZATION regress_seq_user;
REVOKE ALL ON seq3 FROM regress_seq_user;
ERROR:  permission denied for sequence seq3
GRANT USAGE ON seq3 TO regress_seq_user;
ERROR:  current transaction is aborted, commands ignored until end of transaction block
SELECT nextval('seq3');
ERROR:  current transaction is aborted, commands ignored until end of transaction block
ROLLBACK;
DROP SEQUENCE seq3;
CREATE SEQUENCE seq3;
-- currval
BEGIN;
SET LOCAL SESSION AUTHORIZATION regress_seq_user;
SELECT nextval('seq3');
ERROR:  permission denied for sequence seq3
REVOKE ALL ON seq3 FROM regress_seq_user;
ERROR:  current transaction is aborted, commands ignored until end of transaction block
GRANT SELECT ON seq3 TO regress_seq_user;
ERROR:  current transaction is aborted, commands ignored until end of transaction block
SELECT currval('seq3');
ERROR:  current transaction is aborted, commands ignored until end of transaction block
ROLLBACK;
DROP SEQUENCE seq3;
CREATE SEQUENCE seq3;
BEGIN;
SET LOCAL SESSION AUTHORIZATION regress_seq_user;
SELECT nextval('seq3');
ERROR:  permission denied for sequence seq3
REVOKE ALL ON seq3 FROM regress_seq_user;
ERROR:  current transaction is aborted, commands ignored until end of transaction block
GRANT UPDATE ON seq3 TO regress_seq_user;
ERROR:  current transaction is aborted, commands ignored until end of transaction block
SELECT currval('seq3');
ERROR:  current transaction is aborted, commands ignored until end of transaction block
ROLLBACK;
DROP SEQUENCE seq3;
CREATE SEQUENCE seq3;
BEGIN;
SET LOCAL SESSION AUTHORIZATION regress_seq_user;
SELECT nextval('seq3');
ERROR:  permission denied for sequence seq3
REVOKE ALL ON seq3 FROM regress_seq_user;
ERROR:  current transaction is aborted, commands ignored until end of transaction block
GRANT USAGE ON seq3 TO regress_seq_user;
ERROR:  current transaction is aborted, commands ignored until end of transaction block
SELECT currval('seq3');
ERROR:  current transaction is aborted, commands ignored until end of transaction block
ROLLBACK;
DROP SEQUENCE seq3;
CREATE SEQUENCE seq3;
-- lastval
BEGIN;
SET LOCAL SESSION AUTHORIZATION regress_seq_user;
SELECT nextval('seq3');
ERROR:  permission denied for sequence seq3
REVOKE ALL ON seq3 FROM regress_seq_user;
ERROR:  current transaction is aborted, commands ignored until end of transaction block
GRANT SELECT ON seq3 TO regress_seq_user;
ERROR:  current transaction is aborted, commands ignored until end of transaction block
SELECT lastval();
ERROR:  current transaction is aborted, commands ignored until end of transaction block
ROLLBACK;
DROP SEQUENCE seq3;
CREATE SEQUENCE seq3;
BEGIN;
SET LOCAL SESSION AUTHORIZATION regress_seq_user;
SELECT nextval('seq3');
ERROR:  permission denied for sequence seq3
REVOKE ALL ON seq3 FROM regress_seq_user;
ERROR:  current transaction is aborted, commands ignored until end of transaction block
GRANT UPDATE ON seq3 TO regress_seq_user;
ERROR:  current transaction is aborted, commands ignored until end of transaction block
SELECT lastval();
ERROR:  current transaction is aborted, commands ignored until end of transaction block
ROLLBACK;
DROP SEQUENCE seq3;
CREATE SEQUENCE seq3;
BEGIN;
SET LOCAL SESSION AUTHORIZATION regress_seq_user;
SELECT nextval('seq3');
ERROR:  permission denied for sequence seq3
REVOKE ALL ON seq3 FROM regress_seq_user;
ERROR:  current transaction is aborted, commands ignored until end of transaction block
GRANT USAGE ON seq3 TO regress_seq_user;
ERROR:  current transaction is aborted, commands ignored until end of transaction block
SELECT lastval();
ERROR:  current transaction is aborted, commands ignored until end of transaction block
ROLLBACK;
DROP SEQUENCE seq3;
CREATE SEQUENCE seq3;
-- setval
BEGIN;
SET LOCAL SESSION AUTHORIZATION regress_seq_user;
REVOKE ALL ON seq3 FROM regress_seq_user;
ERROR:  permission denied for sequence seq3
SAVEPOINT save;
ERROR:  current transaction is aborted, commands ignored until end of transaction block
SELECT setval('seq3', 5);
ERROR:  current transaction is aborted, commands ignored until end of transaction block
ROLLBACK TO save;
ERROR:  savepoint "save" does not exist
GRANT UPDATE ON seq3 TO regress_seq_user;
ERROR:  current transaction is aborted, commands ignored until end of transaction block
SELECT setval('seq3', 5);
ERROR:  current transaction is aborted, commands ignored until end of transaction block
SELECT nextval('seq3');
ERROR:  current transaction is aborted, commands ignored until end of transaction block
ROLLBACK;
DROP SEQUENCE seq3;
-- Sequences should get wiped out as well:
DROP TABLE serialTest1;
DROP TABLE serialTest2;
-- Make sure sequences are gone:
SELECT * FROM information_schema.sequences WHERE sequence_name IN
  ('sequence_test2', 'serialtest2_f2_seq', 'serialtest2_f3_seq',
   'serialtest2_f4_seq', 'serialtest2_f5_seq', 'serialtest2_f6_seq')
  ORDER BY sequence_name ASC;
 sequence_catalog | sequence_schema | sequence_name | data_type | numeric_precision | numeric_precision_radix | numeric_scale | start_value | minimum_value | maximum_value | increment | cycle_option 
------------------+-----------------+---------------+-----------+-------------------+-------------------------+---------------+-------------+---------------+---------------+-----------+--------------
(0 rows)

DROP USER regress_seq_user;
DROP SEQUENCE seq;
-- cache tests
CREATE SEQUENCE test_seq1 CACHE 10;
SELECT nextval('test_seq1');
 nextval 
---------
       1
(1 row)

SELECT nextval('test_seq1');
 nextval 
---------
       2
(1 row)

SELECT nextval('test_seq1');
 nextval 
---------
       3
(1 row)

DROP SEQUENCE test_seq1;
create table tseq(a serial primary key, b int);
insert into tseq(b) values(1),(2),(3);
select*from tseq;
 a | b 
---+---
 1 | 1
 2 | 2
 3 | 3
(3 rows)

create table tseq3(a serial primary key, b smallserial, c bigserial);
insert into tseq3(c) values(1),(2),(3);
select*from tseq3;
 a | b | c 
---+---+---
 1 | 1 | 1
 2 | 2 | 2
 3 | 3 | 3
(3 rows)

CREATE TABLE itest8 (a int GENERATED ALWAYS AS IDENTITY primary key, b text, c bigserial);
insert into itest8(b) values('1'),('abc2'),('def3');
select*from itest8;
 a |  b   | c 
---+------+---
 1 | 1    | 1
 2 | abc2 | 2
 3 | def3 | 3
(3 rows)

create sequence seq2;
create table tseq2(a serial primary key, b smallserial, c bigserial, d int auto_increment, e int generated by default as identity, f int default nextval('seq2')) partition by hash(a);
create table tseq21 partition of tseq2 for values with (modulus 4, remainder 0);
create table tseq22 partition of tseq2 for values with (modulus 4, remainder 1);
create table tseq23 partition of tseq2 for values with (modulus 4, remainder 2);
create table tseq24 partition of tseq2 for values with (modulus 4, remainder 3);
insert into tseq2(e, f) values(default, default),(34, default),(default, default),(45, default);
select*from tseq2;
 a | b | c | d | e  | f 
---+---+---+---+----+---
 1 | 1 | 1 | 1 |  1 | 1
 3 | 3 | 3 | 3 |  2 | 3
 2 | 2 | 2 | 2 | 34 | 2
 4 | 4 | 4 | 4 | 45 | 4
(4 rows)

insert into tseq2(e) values(11),(default),(33),(default);
select*from tseq2;
 a | b | c | d | e  | f 
---+---+---+---+----+---
 1 | 1 | 1 | 1 |  1 | 1
 3 | 3 | 3 | 3 |  2 | 3
 5 | 5 | 5 | 5 | 11 | 5
 8 | 8 | 8 | 8 |  4 | 8
 2 | 2 | 2 | 2 | 34 | 2
 4 | 4 | 4 | 4 | 45 | 4
 6 | 6 | 6 | 6 |  3 | 6
 7 | 7 | 7 | 7 | 33 | 7
(8 rows)

insert into tseq2(f) values(111),(default),(333),(default);
select*from tseq2;
 a  | b  | c  | d  | e  |  f  
----+----+----+----+----+-----
  1 |  1 |  1 |  1 |  1 |   1
 12 | 12 | 12 | 12 |  8 |  10
  3 |  3 |  3 |  3 |  2 |   3
  5 |  5 |  5 |  5 | 11 |   5
  8 |  8 |  8 |  8 |  4 |   8
  9 |  9 |  9 |  9 |  5 | 111
 11 | 11 | 11 | 11 |  7 | 333
  2 |  2 |  2 |  2 | 34 |   2
  4 |  4 |  4 |  4 | 45 |   4
  6 |  6 |  6 |  6 |  3 |   6
  7 |  7 |  7 |  7 | 33 |   7
 10 | 10 | 10 | 10 |  6 |   9
(12 rows)

create table tseq1(a serial primary key, b smallserial, c bigserial, d int) partition by hash(a);
create table tseq11 partition of tseq1 for values with (modulus 4, remainder 0);
create table tseq12 partition of tseq1 for values with (modulus 4, remainder 1);
create table tseq13 partition of tseq1 for values with (modulus 4, remainder 2);
create table tseq14 partition of tseq1 for values with (modulus 4, remainder 3);
insert into tseq1(d) values(1),(2),(3),(4), (5),(6),(7),(8);
select*from tseq1;
 a | b | c | d 
---+---+---+---
 1 | 1 | 1 | 1
 3 | 3 | 3 | 3
 5 | 5 | 5 | 5
 8 | 8 | 8 | 8
 2 | 2 | 2 | 2
 4 | 4 | 4 | 4
 6 | 6 | 6 | 6
 7 | 7 | 7 | 7
(8 rows)

drop table tseq1;
drop table tseq2;
drop table itest8;
drop table tseq3;
drop table tseq;
drop sequence seq2;
CREATE TABLE itest8 (a int GENERATED ALWAYS AS IDENTITY primary key, b text, c bigserial);
create table tseq(a serial primary key, b int);
create table tseq3(a serial primary key, b smallserial, c bigserial);
create table tseq2(a serial primary key, b smallserial, c bigserial) partition by hash(a);
create table tseq4(a serial primary key, b int generated always as identity, c bigserial);
create table tseq5(a serial primary key, b int generated always as identity);
create table tseq6(a serial primary key, b int);
create table tseq1(a serial primary key, b smallserial, c bigserial) partition by hash(a);
create table tseq11 partition of tseq1 for values with (modulus 4, remainder 0);
create table tseq12 partition of tseq1 for values with (modulus 4, remainder 1);
create table tseq13 partition of tseq1 for values with (modulus 4, remainder 2);
create table tseq14 partition of tseq1 for values with (modulus 4, remainder 3);
drop table tseq3;
drop table tseq;
drop table itest8;
drop table tseq2;
drop table tseq4;
drop table tseq5;
drop table tseq6;
drop table tseq1;
-- oracle sequence grammar
create sequence seq34 nomaxvalue nominvalue nocache nocycle noorder starts with 34;
create sequence seq35 nomaxvalue nominvalue cache 1 no cycle order starts with 35;
select seq34.nextval;
 nextval 
---------
      34
(1 row)

select seq35.currval;
ERROR:  currval of sequence "seq35" is not yet defined in this session
select seq35.nextval;
 nextval 
---------
      35
(1 row)

select seq35.currval;
 currval 
---------
      35
(1 row)

drop sequence seq35;
drop sequence seq34;
-- seq value fetch
create table t6(a int auto_increment primary key, b serial, c int generated by default as identity,d int);
insert into t6(d) values(11),(22),(33);
insert into t6(d) values(11),(22),(33);
insert into t6(d) values(11),(22),(33);
insert into t6(d) values(11),(22),(33);
select*from t6;
 a  | b  | c  | d  
----+----+----+----
  1 |  1 |  1 | 11
  2 |  2 |  2 | 22
  3 |  3 |  3 | 33
  4 |  4 |  4 | 11
  5 |  5 |  5 | 22
  6 |  6 |  6 | 33
  7 |  7 |  7 | 11
  8 |  8 |  8 | 22
  9 |  9 |  9 | 33
 10 | 10 | 10 | 11
 11 | 11 | 11 | 22
 12 | 12 | 12 | 33
(12 rows)

select currval('t6_a_seq');
 currval 
---------
      12
(1 row)

select currval('t6_b_seq');
 currval 
---------
      12
(1 row)

select nextval('t6_b_seq');
 nextval 
---------
      13
(1 row)

select currval('t6_c_seq');
 currval 
---------
      12
(1 row)

create sequence seq7;
create sequence seq6;
create sequence seq56;
create table t55(a serial primary key, b int default nextval('seq56') , c int);
alter sequence seq56 owned by t55.b;
insert into t55(c) values(1),(2),(3);
select*from t55;
 a | b | c 
---+---+---
 1 | 1 | 1
 2 | 2 | 2
 3 | 3 | 3
(3 rows)

drop table if exists t7;
NOTICE:  table "t7" does not exist, skipping
create table t7(a int auto_increment primary key, b serial, c int generated by default as identity,d int default nextval('seq7'), e int);
insert into t7 (e) values(11),(22),(33) returning *;
 a | b | c | d | e  
---+---+---+---+----
 1 | 1 | 1 | 1 | 11
 2 | 2 | 2 | 2 | 22
 3 | 3 | 3 | 3 | 33
(3 rows)

insert into t7 (e) values(11),(22),(33) returning *;
 a | b | c | d | e  
---+---+---+---+----
 4 | 4 | 4 | 4 | 11
 5 | 5 | 5 | 5 | 22
 6 | 6 | 6 | 6 | 33
(3 rows)

insert into t7 (e) values(11),(22),(33) returning *;
 a | b | c | d | e  
---+---+---+---+----
 7 | 7 | 7 | 7 | 11
 8 | 8 | 8 | 8 | 22
 9 | 9 | 9 | 9 | 33
(3 rows)

insert into t7 (e) values(11),(22),(33) returning *;
 a  | b  | c  | d  | e  
----+----+----+----+----
 10 | 10 | 10 | 10 | 11
 11 | 11 | 11 | 11 | 22
 12 | 12 | 12 | 12 | 33
(3 rows)

select*from t7;
 a  | b  | c  | d  | e  
----+----+----+----+----
  1 |  1 |  1 |  1 | 11
  2 |  2 |  2 |  2 | 22
  3 |  3 |  3 |  3 | 33
  4 |  4 |  4 |  4 | 11
  5 |  5 |  5 |  5 | 22
  6 |  6 |  6 |  6 | 33
  7 |  7 |  7 |  7 | 11
  8 |  8 |  8 |  8 | 22
  9 |  9 |  9 |  9 | 33
 10 | 10 | 10 | 10 | 11
 11 | 11 | 11 | 11 | 22
 12 | 12 | 12 | 12 | 33
(12 rows)

select currval('t7_a_seq');
 currval 
---------
      12
(1 row)

select currval('t7_b_seq');
 currval 
---------
      12
(1 row)

select currval('t7_c_seq');
 currval 
---------
      12
(1 row)

select currval('seq7');
 currval 
---------
      12
(1 row)

select seq7.nextval, seq7.currval, seq7.nextval, seq7.currval;
 nextval | currval | nextval | currval 
---------+---------+---------+---------
      13 |      13 |      14 |      14
(1 row)

select seq6.nextval, seq7.currval, seq7.nextval, seq6.currval;
 nextval | currval | nextval | currval 
---------+---------+---------+---------
       1 |      14 |      15 |       1
(1 row)

insert into t6(c,d) values(seq6.nextval, seq7.nextval),(seq6.nextval, seq7.nextval),(seq6.currval, seq7.currval);
insert into t6(c,d) values(seq6.nextval, seq7.nextval),(seq6.nextval, seq7.nextval),(seq6.currval, seq7.currval);
insert into t6(c,d) values(seq6.nextval, seq7.nextval),(seq6.nextval, seq7.nextval),(seq6.currval, seq7.currval);
insert into t6(c,d) values(seq6.currval, seq7.currval),(seq6.currval, seq7.currval),(seq6.nextval, seq7.nextval);
select*from t6;
 a  | b  | c  | d  
----+----+----+----
  1 |  1 |  1 | 11
  2 |  2 |  2 | 22
  3 |  3 |  3 | 33
  4 |  4 |  4 | 11
  5 |  5 |  5 | 22
  6 |  6 |  6 | 33
  7 |  7 |  7 | 11
  8 |  8 |  8 | 22
  9 |  9 |  9 | 33
 10 | 10 | 10 | 11
 11 | 11 | 11 | 22
 12 | 12 | 12 | 33
 13 | 14 |  2 | 16
 14 | 15 |  3 | 17
 15 | 16 |  3 | 17
 16 | 17 |  4 | 18
 17 | 18 |  5 | 19
 18 | 19 |  5 | 19
 19 | 20 |  6 | 20
 20 | 21 |  7 | 21
 21 | 22 |  7 | 21
 22 | 23 |  7 | 21
 23 | 24 |  7 | 21
 24 | 25 |  8 | 22
(24 rows)

create schema scm1;
alter sequence seq7 set schema scm1;
-- alter sequence scm1.seq7 rename to scm1.seq77;
-- above doesn't work, new name can't have schema name prepended.
-- below stmt rename a seq but doesn't move it to public schema, seq77 is still in scm1.
alter sequence scm1.seq7 rename to seq77;
select scm1.seq77.nextval, scm1.seq77.currval;
 nextval | currval 
---------+---------
      23 |      23
(1 row)

select lastval();
 lastval 
---------
      23
(1 row)

drop schema scm1;
ERROR:  cannot drop schema scm1 because other objects depend on it
DETAIL:  sequence scm1.seq77 depends on schema scm1
default value for column d of table t7 depends on sequence scm1.seq77
HINT:  Use DROP ... CASCADE to drop the dependent objects too.
drop schema scm1 cascade;
NOTICE:  drop cascades to 2 other objects
DETAIL:  drop cascades to sequence scm1.seq77
drop cascades to default value for column d of table t7
drop table t6;
drop table t7;
drop table t55;
drop sequence seq7;
ERROR:  sequence "seq7" does not exist
drop sequence seq6;
drop sequence seq56;
ERROR:  sequence "seq56" does not exist
drop sequence sequence_test5;
drop sequence sequence_test6;
drop sequence sequence_test7;
drop sequence sequence_test8;
drop sequence sequence_test9;
drop sequence sequence_test10;
drop sequence sequence_test11;
drop sequence sequence_test12;
drop sequence sequence_test13;
drop sequence sequence_test14;
drop sequence sequence_test3;
